In [1]:
import pandas as pd
Employee = {
    "First": ["vishnu", "siva", "madhu"],
    "Last": ["Chegondi", "Prasad", "Vasanth"],
    "email": ["Vishnu.chegondi@email.com","siva.prasad@email.com","madhu.vasanth@email.com"]
}
employee_df = pd.DataFrame(Employee)

In [2]:
employee_df['FullName'] = employee_df['First']+' '+employee_df['Last']
employee_df

    First      Last                      email         FullName
0  vishnu  Chegondi  Vishnu.chegondi@email.com  vishnu Chegondi
1    siva    Prasad      siva.prasad@email.com      siva Prasad
2   madhu   Vasanth    madhu.vasanth@email.com    madhu Vasanth

In [3]:
employee_df.drop(columns=['First','Last'], inplace=True)
employee_df

                       email         FullName
0  Vishnu.chegondi@email.com  vishnu Chegondi
1      siva.prasad@email.com      siva Prasad
2    madhu.vasanth@email.com    madhu Vasanth

In [4]:
employee_df[['First','Last']]=employee_df['FullName'].str.split(' ', expand=True)
employee_df

                       email         FullName   First      Last
0  Vishnu.chegondi@email.com  vishnu Chegondi  vishnu  Chegondi
1      siva.prasad@email.com      siva Prasad    siva    Prasad
2    madhu.vasanth@email.com    madhu Vasanth   madhu   Vasanth

In [5]:
employee_df = employee_df.append({'Developer':True},ignore_index=True, sort=False)
employee_df

                       email         FullName   First      Last  Developer
0  Vishnu.chegondi@email.com  vishnu Chegondi  vishnu  Chegondi        NaN
1      siva.prasad@email.com      siva Prasad    siva    Prasad        NaN
2    madhu.vasanth@email.com    madhu Vasanth   madhu   Vasanth        NaN
3                        NaN              NaN     NaN       NaN        1.0

In [6]:
filt = employee_df["Developer"]==True
employee_df.drop(index=employee_df[filt].index)

                       email         FullName   First      Last  Developer
0  Vishnu.chegondi@email.com  vishnu Chegondi  vishnu  Chegondi        NaN
1      siva.prasad@email.com      siva Prasad    siva    Prasad        NaN
2    madhu.vasanth@email.com    madhu Vasanth   madhu   Vasanth        NaN